In [144]:
import pandas as pd

In [145]:
from faker import Faker

In [147]:
en_fake = Faker()
fa_fake = Faker('Fa')

In [148]:
en_fake.name()

'Patrick Gordon'

Loading Data

In [149]:
from names_dataset import NameDataset

In [150]:
nd = NameDataset()

In [151]:
import numpy as np

In [152]:
def make_fake():
    if np.random.rand() > 0.5:
        return en_fake.name()
    return fa_fake.name()

In [153]:
df = pd.DataFrame({
    'Name' : [make_fake() for _ in range(10)]
    })

In [154]:
df.head()

              Name
0   Austin Robbins
1  Nancy Blanchard
2   Katie Gonzalez
3   Joshua Donovan
4  فاطمه زهرا قاضی

In [155]:
full_name = en_fake.name()
full_name

'Erica Lee'

Extract First Name AND Last Name

In [13]:
#def get_fname_lname(name):
#   first_name, *_, last_name = full_name.split()
#   return first_name, last_name

In [156]:
df['First Name'] = df['Name'].apply(
    lambda full_name: full_name.split()[0]
)

In [157]:
df['Last Name'] = df['Name'].apply(
    lambda full_name: full_name.split()[1]
)

In [158]:
df.head()

              Name First Name  Last Name
0   Austin Robbins     Austin    Robbins
1  Nancy Blanchard      Nancy  Blanchard
2   Katie Gonzalez      Katie   Gonzalez
3   Joshua Donovan     Joshua    Donovan
4  فاطمه زهرا قاضی      فاطمه       زهرا

In [159]:
def name_to_gender(first_name):
    output = nd.search(first_name)['first_name']
    if output is None:
        return None
    return max(output['gender'], key=output['gender'].get)

In [160]:
name_to_gender('Amir')

'Male'

In [161]:
df['Gender'] = df['First Name'].apply(name_to_gender)
df

              Name First Name  Last Name  Gender
0   Austin Robbins     Austin    Robbins    Male
1  Nancy Blanchard      Nancy  Blanchard  Female
2   Katie Gonzalez      Katie   Gonzalez  Female
3   Joshua Donovan     Joshua    Donovan    Male
4  فاطمه زهرا قاضی      فاطمه       زهرا  Female
5   اميرعلي ضرغامی    اميرعلي     ضرغامی    Male
6    Haley Manning      Haley    Manning  Female
7      فاطمه عقیلی      فاطمه      عقیلی  Female
8      مهدي شمشیری       مهدي     شمشیری    Male
9     Jared Landry      Jared     Landry    Male

In [164]:
def country_x(first_name):
    country_out = nd.search(first_name)['first_name']['country'].items()
    return country_out

In [165]:
country_x('amir')

dict_items([('United Arab Emirates', 0.06), ('Algeria', 0.096), ('Egypt', 0.176), ('Israel', 0.035), ('Iran, Islamic Republic of', 0.168), ('Morocco', 0.085), ('Malaysia', 0.093), ('Oman', 0.035), ('Saudi Arabia', 0.182), ('Tunisia', 0.07)])

In [167]:
df['Country'] = df['First Name'].apply(country_x)

In [168]:
df

,Name,First Name,Last Name,Gender,Country
0,Austin Robbins,Austin,Robbins,Male,"((Canada, 0.043), (Colombia, 0.007), (Costa Ri..."
1,Nancy Blanchard,Nancy,Blanchard,Female,"((Belgium, 0.036), (Bolivia, Plurinational Sta..."
2,Katie Gonzalez,Katie,Gonzalez,Female,"((Canada, 0.039), (Costa Rica, 0.005), (France..."
3,Joshua Donovan,Joshua,Donovan,Male,"((Canada, 0.036), (United Kingdom, 0.133), (It..."
4,فاطمه زهرا قاضی,فاطمه,زهرا,Female,"((Egypt, 0.313), (Iraq, 0.172), (Iran, Islamic..."
5,اميرعلي ضرغامی,اميرعلي,ضرغامی,Male,"((United Arab Emirates, 0.02), (Egypt, 0.034),..."
6,Haley Manning,Haley,Manning,Female,"((Canada, 0.054), (China, 0.003), (Costa Rica,..."
7,فاطمه عقیلی,فاطمه,عقیلی,Female,"((Egypt, 0.313), (Iraq, 0.172), (Iran, Islamic..."
8,مهدي شمشیری,مهدي,شمشیری,Male,"((Algeria, 0.04), (Egypt, 0.036), (Iraq, 0.589..."
9,Jared Landry,Jared,Landry,Male,"((Canada, 0.055), (Colombia, 0.008), (Costa Ri..."